var wechat_addr_data = [{"id": "110000", "name": "北京", "child": [{"id": "100000", "name": "北京市"}]}, {
    "id": "310000",
    "name": "上海",
    "child": [{"id": "200000", "name": "上海市"}]
}, {"id": "120000", "name": "天津", "child": [{"id": "300000", "name": "天津市"}]}, {
    "id": "500000",
    "name": "重庆",
    "child": [{"id": "400000", "name": "重庆市"}]
}, {
    "id": "340000",
    "name": "安徽省",
    "child": [{"id": "340800", "name": "安庆市"}, {"id": "233000", "name": "蚌埠市"}, {
        "id": "236800",
        "name": "亳州市"
    }, {"id": "247000", "name": "池州市"}, {"id": "239000", "name": "滁州市"}, {
        "id": "236000",
        "name": "阜阳市"
    }, {"id": "230000", "name": "合肥市"}, {"id": "235000", "name": "淮北市"}, {
        "id": "232000",
        "name": "淮南市"
    }, {"id": "245000", "name": "黄山市"}, {"id": "237000", "name": "六安市"}, {
        "id": "243000",
        "name": "马鞍山市"
    }, {"id": "234000", "name": "宿州市"}, {"id": "244000", "name": "铜陵市"}, {
        "id": "241000",
        "name": "芜湖市"
    }, {"id": "242000", "name": "宣城市"}]
}, {
    "id": "350000",
    "name": "福建省",
    "child": [{"id": "350000", "name": "福州市"}, {"id": "364000", "name": "龙岩市"}, {
        "id": "353000",
        "name": "南平市"
    }, {"id": "352100", "name": "宁德市"}, {"id": "351100", "name": "莆田市"}, {
        "id": "362000",
        "name": "泉州市"
    }, {"id": "365000", "name": "三明市"}, {"id": "361000", "name": "厦门市"}, {"id": "363000", "name": "漳州市"}]
}, {
    "id": "620000",
    "name": "甘肃省",
    "child": [{"id": "730900", "name": "白银市"}, {"id": "743000", "name": "定西市"}, {
        "id": "747000",
        "name": "甘南藏族"
    }, {"id": "735100", "name": "嘉峪关市"}, {"id": "737100", "name": "金昌市"}, {
        "id": "735000",
        "name": "酒泉市"
    }, {"id": "730000", "name": "兰州市"}, {"id": "731100", "name": "临夏回族"}, {
        "id": "746000",
        "name": "陇南市"
    }, {"id": "744000", "name": "平凉市"}, {"id": "745000", "name": "庆阳市"}, {
        "id": "741000",
        "name": "天水市"
    }, {"id": "733000", "name": "武威市"}, {"id": "734000", "name": "张掖市"}]
}, {
    "id": "440000",
    "name": "广东省",
    "child": [{"id": "521000", "name": "潮州市"}, {"id": "511700", "name": "东莞市"}, {
        "id": "528000",
        "name": "佛山市"
    }, {"id": "510000", "name": "广州市"}, {"id": "517000", "name": "河源市"}, {
        "id": "516000",
        "name": "惠州市"
    }, {"id": "529000", "name": "江门市"}, {"id": "522000", "name": "揭阳市"}, {
        "id": "525000",
        "name": "茂名市"
    }, {"id": "514000", "name": "梅州市"}, {"id": "511500", "name": "清远市"}, {
        "id": "515000",
        "name": "汕头市"
    }, {"id": "516600", "name": "汕尾市"}, {"id": "512000", "name": "韶关市"}, {
        "id": "518000",
        "name": "深圳市"
    }, {"id": "529500", "name": "阳江市"}, {"id": "527300", "name": "云浮市"}, {
        "id": "524000",
        "name": "湛江市"
    }, {"id": "526000", "name": "肇庆市"}, {"id": "528400", "name": "中山市"}, {"id": "519000", "name": "珠海市"}]
}, {
    "id": "450000",
    "name": "广西壮族",
    "child": [{"id": "533000", "name": "百色市"}, {"id": "536000", "name": "北海市"}, {
        "id": "532200",
        "name": "崇左市"
    }, {"id": "538000", "name": "防城港市"}, {"id": "537100", "name": "贵港市"}, {
        "id": "541000",
        "name": "桂林市"
    }, {"id": "547000", "name": "河池市"}, {"id": "542899", "name": "贺州市"}, {
        "id": "546100",
        "name": "来宾市"
    }, {"id": "545000", "name": "柳州市"}, {"id": "530000", "name": "南宁市"}, {
        "id": "535000",
        "name": "钦州市"
    }, {"id": "543000", "name": "梧州市"}, {"id": "537000", "name": "玉林市"}]
}, {
    "id": "520000",
    "name": "贵州省",
    "child": [{"id": "561000", "name": "安顺市"}, {"id": "551700", "name": "毕节市"}, {
        "id": "550000",
        "name": "贵阳市"
    }, {"id": "553000", "name": "六盘水市"}, {"id": "556000", "name": "黔东南苗族侗族"}, {
        "id": "558000",
        "name": "黔南布依族苗族"
    }, {"id": "562400", "name": "黔西南布依族苗族"}, {"id": "554300", "name": "铜仁市"}, {"id": "563000", "name": "遵义市"}]
}, {
    "id": "460000",
    "name": "海南省",
    "child": [{"id": "572800", "name": "白沙黎族自治县"}, {"id": "572300", "name": "保亭黎族苗族自治县"}, {
        "id": "572700",
        "name": "昌江黎族自治县"
    }, {"id": "571900", "name": "澄迈县"}, {"id": "571700", "name": "儋州市"}, {
        "id": "571200",
        "name": "定安县"
    }, {"id": "572600", "name": "东方市"}, {"id": "570000", "name": "海口市"}, {
        "id": "572500",
        "name": "乐东黎族自治县"
    }, {"id": "571800", "name": "临高县"}, {"id": "572400", "name": "陵水黎族自治县"}, {
        "id": "571400",
        "name": "琼海市"
    }, {"id": "572900", "name": "琼中黎族苗族自治县"}, {"id": "573199", "name": "三沙市"}, {
        "id": "572000",
        "name": "三亚市"
    }, {"id": "571600", "name": "屯昌县"}, {"id": "571500", "name": "万宁市"}, {
        "id": "571300",
        "name": "文昌市"
    }, {"id": "572200", "name": "五指山市"}]
}, {
    "id": "130000",
    "name": "河北省",
    "child": [{"id": "071000", "name": "保定市"}, {"id": "061000", "name": "沧州市"}, {
        "id": "067000",
        "name": "承德市"
    }, {"id": "053000", "name": "衡水市"}, {"id": "065000", "name": "廊坊市"}, {
        "id": "066000",
        "name": "秦皇岛市"
    }, {"id": "050000", "name": "石家庄市"}, {"id": "063000", "name": "唐山市"}, {
        "id": "054000",
        "name": "邢台市"
    }, {"id": "075000", "name": "张家口市"}]
}, {
    "id": "410000",
    "name": "河南省",
    "child": [{"id": "455000", "name": "安阳市"}, {"id": "458000", "name": "鹤壁市"}, {
        "id": "454650",
        "name": "济源市"
    }, {"id": "454000", "name": "焦作市"}, {"id": "475000", "name": "开封市"}, {
        "id": "471000",
        "name": "洛阳市"
    }, {"id": "462000", "name": "漯河市"}, {"id": "473000", "name": "南阳市"}, {
        "id": "467000",
        "name": "平顶山市"
    }, {"id": "457000", "name": "濮阳市"}, {"id": "472000", "name": "三门峡市"}, {
        "id": "476000",
        "name": "商丘市"
    }, {"id": "453000", "name": "新乡市"}, {"id": "464000", "name": "信阳市"}, {
        "id": "461000",
        "name": "许昌市"
    }, {"id": "450000", "name": "郑州市"}, {"id": "466000", "name": "周口市"}, {"id": "463000", "name": "驻马店市"}]
}, {
    "id": "230000",
    "name": "黑龙江省",
    "child": [{"id": "163000", "name": "大庆市"}, {"id": "150000", "name": "哈尔滨市"}, {
        "id": "154100",
        "name": "鹤岗市"
    }, {"id": "164300", "name": "黑河市"}, {"id": "158100", "name": "鸡西市"}, {
        "id": "154000",
        "name": "佳木斯市"
    }, {"id": "157000", "name": "牡丹江市"}, {"id": "154600", "name": "七台河市"}, {
        "id": "161000",
        "name": "齐齐哈尔市"
    }, {"id": "155100", "name": "双鸭山市"}, {"id": "152000", "name": "绥化市"}, {"id": "153000", "name": "伊春市"}]
}, {
    "id": "420000",
    "name": "湖北省",
    "child": [{"id": "436000", "name": "鄂州市"}, {"id": "438000", "name": "黄冈市"}, {
        "id": "435000",
        "name": "黄石市"
    }, {"id": "448000", "name": "荆门市"}, {"id": "434100", "name": "荆州市"}, {
        "id": "433100",
        "name": "潜江市"
    }, {"id": "442400", "name": "神农架"}, {"id": "442000", "name": "十堰市"}, {
        "id": "441300",
        "name": "随州市"
    }, {"id": "431700", "name": "天门市"}, {"id": "430000", "name": "武汉市"}, {
        "id": "437000",
        "name": "咸宁市"
    }, {"id": "433000", "name": "仙桃市"}, {"id": "441000", "name": "襄阳市"}, {
        "id": "432100",
        "name": "孝感市"
    }, {"id": "443000", "name": "宜昌市"}]
}, {
    "id": "430000",
    "name": "湖南省",
    "child": [{"id": "415000", "name": "常德市"}, {"id": "423000", "name": "郴州市"}, {
        "id": "421000",
        "name": "衡阳市"
    }, {"id": "418000", "name": "怀化市"}, {"id": "417000", "name": "娄底市"}, {
        "id": "422000",
        "name": "邵阳市"
    }, {"id": "411100", "name": "湘潭市"}, {"id": "416000", "name": "湘西土家族苗族"}, {
        "id": "425000",
        "name": "永州市"
    }, {"id": "414000", "name": "岳阳市"}, {"id": "427000", "name": "张家界市"}, {
        "id": "410000",
        "name": "长沙市"
    }, {"id": "412000", "name": "株洲市"}]
}, {
    "id": "220000",
    "name": "吉林省",
    "child": [{"id": "137000", "name": "白城市"}, {"id": "134300", "name": "白山市"}, {
        "id": "132000",
        "name": "吉林市"
    }, {"id": "136200", "name": "辽源市"}, {"id": "136000", "name": "四平市"}, {
        "id": "138000",
        "name": "松原市"
    }, {"id": "134000", "name": "通化市"}, {"id": "130000", "name": "长春市"}]
}, {
    "id": "320000",
    "name": "江苏省",
    "child": [{"id": "213000", "name": "常州市"}, {"id": "223200", "name": "淮安市"}, {
        "id": "222000",
        "name": "连云港市"
    }, {"id": "210000", "name": "南京市"}, {"id": "226000", "name": "南通市"}, {
        "id": "215000",
        "name": "苏州市"
    }, {"id": "223800", "name": "宿迁市"}, {"id": "225300", "name": "泰州市"}, {
        "id": "214000",
        "name": "无锡市"
    }, {"id": "221000", "name": "徐州市"}, {"id": "224000", "name": "盐城市"}, {
        "id": "225000",
        "name": "扬州市"
    }, {"id": "212000", "name": "镇江市"}]
}, {
    "id": "360000",
    "name": "江西省",
    "child": [{"id": "344000", "name": "抚州市"}, {"id": "341000", "name": "赣州市"}, {
        "id": "343000",
        "name": "吉安市"
    }, {"id": "333000", "name": "景德镇市"}, {"id": "332000", "name": "九江市"}, {
        "id": "330000",
        "name": "南昌市"
    }, {"id": "337000", "name": "萍乡市"}, {"id": "334000", "name": "上饶市"}, {
        "id": "336500",
        "name": "新余市"
    }, {"id": "336000", "name": "宜春市"}, {"id": "335000", "name": "鹰潭市"}]
}, {
    "id": "210000",
    "name": "辽宁省",
    "child": [{"id": "114000", "name": "鞍山市"}, {"id": "117000", "name": "本溪市"}, {
        "id": "122000",
        "name": "朝阳市"
    }, {"id": "116000", "name": "大连市"}, {"id": "118000", "name": "丹东市"}, {
        "id": "113000",
        "name": "抚顺市"
    }, {"id": "123000", "name": "阜新市"}, {"id": "125000", "name": "葫芦岛市"}, {
        "id": "121000",
        "name": "锦州市"
    }, {"id": "111000", "name": "辽阳市"}, {"id": "124000", "name": "盘锦市"}, {
        "id": "110000",
        "name": "沈阳市"
    }, {"id": "112000", "name": "铁岭市"}, {"id": "115000", "name": "营口市"}]
}, {
    "id": "150000",
    "name": "内蒙古",
    "child": [{"id": "015000", "name": "巴彦淖尔市"}, {"id": "014000", "name": "包头市"}, {
        "id": "024000",
        "name": "赤峰市"
    }, {"id": "017000", "name": "鄂尔多斯市"}, {"id": "010000", "name": "呼和浩特市"}, {
        "id": "021000",
        "name": "呼伦贝尔市"
    }, {"id": "028000", "name": "通辽市"}, {"id": "016000", "name": "乌海市"}, {"id": "012000", "name": "乌兰察布市"}]
}, {
    "id": "640000",
    "name": "宁夏",
    "child": [{"id": "756000", "name": "固原市"}, {"id": "753000", "name": "石嘴山市"}, {
        "id": "751100",
        "name": "吴忠市"
    }, {"id": "750000", "name": "银川市"}, {"id": "755000", "name": "中卫市"}]
}, {
    "id": "630000",
    "name": "青海省",
    "child": [{"id": "814000", "name": "果洛藏族"}, {"id": "812200", "name": "海北藏族"}, {
        "id": "810699",
        "name": "海东市"
    }, {"id": "813000", "name": "海南藏族"}, {"id": "817000", "name": "海西蒙古族藏族"}, {
        "id": "811300",
        "name": "黄南藏族"
    }, {"id": "810000", "name": "西宁市"}, {"id": "815000", "name": "玉树藏族"}]
}, {
    "id": "370000",
    "name": "山东省",
    "child": [{"id": "256600", "name": "滨州市"}, {"id": "253000", "name": "德州市"}, {
        "id": "257000",
        "name": "东营市"
    }, {"id": "274000", "name": "菏泽市"}, {"id": "250000", "name": "济南市"}, {
        "id": "272100",
        "name": "济宁市"
    }, {"id": "271100", "name": "莱芜市"}, {"id": "252000", "name": "聊城市"}, {
        "id": "276000",
        "name": "临沂市"
    }, {"id": "266000", "name": "青岛市"}, {"id": "276800", "name": "日照市"}, {
        "id": "271000",
        "name": "泰安市"
    }, {"id": "264200", "name": "威海市"}, {"id": "261000", "name": "潍坊市"}, {
        "id": "264000",
        "name": "烟台市"
    }, {"id": "277100", "name": "枣庄市"}, {"id": "255000", "name": "淄博市"}]
}, {
    "id": "140000",
    "name": "山西省",
    "child": [{"id": "037000", "name": "大同市"}, {"id": "048000", "name": "晋城市"}, {
        "id": "030600",
        "name": "晋中市"
    }, {"id": "041000", "name": "临汾市"}, {"id": "033000", "name": "吕梁市"}, {
        "id": "038500",
        "name": "朔州市"
    }, {"id": "030000", "name": "太原市"}, {"id": "034000", "name": "忻州市"}, {
        "id": "045000",
        "name": "阳泉市"
    }, {"id": "044000", "name": "运城市"}, {"id": "046000", "name": "长治市"}]
}, {
    "id": "610000",
    "name": "陕西省",
    "child": [{"id": "725000", "name": "安康市"}, {"id": "721000", "name": "宝鸡市"}, {
        "id": "723000",
        "name": "汉中市"
    }, {"id": "726000", "name": "商洛市"}, {"id": "727000", "name": "铜川市"}, {
        "id": "714000",
        "name": "渭南市"
    }, {"id": "710000", "name": "西安市"}, {"id": "712000", "name": "咸阳市"}, {
        "id": "716000",
        "name": "延安市"
    }, {"id": "719000", "name": "榆林市"}]
}, {
    "id": "510000",
    "name": "四川省",
    "child": [{"id": "624000", "name": "阿坝藏族羌族"}, {"id": "636000", "name": "巴中市"}, {
        "id": "610000",
        "name": "成都市"
    }, {"id": "635000", "name": "达州市"}, {"id": "618000", "name": "德阳市"}, {
        "id": "626000",
        "name": "甘孜藏族"
    }, {"id": "638000", "name": "广安市"}, {"id": "628000", "name": "广元市"}, {
        "id": "614000",
        "name": "乐山市"
    }, {"id": "615000", "name": "凉山彝族"}, {"id": "646000", "name": "泸州市"}, {
        "id": "620010",
        "name": "眉山市"
    }, {"id": "621000", "name": "绵阳市"}, {"id": "637000", "name": "南充市"}, {
        "id": "641000",
        "name": "内江市"
    }, {"id": "617000", "name": "攀枝花市"}, {"id": "629000", "name": "遂宁市"}, {
        "id": "625000",
        "name": "雅安市"
    }, {"id": "644000", "name": "宜宾市"}, {"id": "641300", "name": "资阳市"}, {"id": "643000", "name": "自贡市"}]
}, {
    "id": "650000",
    "name": "维吾尔",
    "child": [{"id": "843000", "name": "阿克苏地区"}, {"id": "843300", "name": "阿拉尔市"}, {
        "id": "836500",
        "name": "阿勒泰地区"
    }, {"id": "841000", "name": "巴音郭楞蒙古"}, {"id": "833400", "name": "博尔塔拉蒙古"}, {
        "id": "831100",
        "name": "昌吉回族"
    }, {"id": "839000", "name": "哈密地区"}, {"id": "848000", "name": "和田地区"}, {
        "id": "844000",
        "name": "喀什地区"
    }, {"id": "834000", "name": "克拉玛依市"}, {"id": "845350", "name": "克孜勒苏柯尔克孜"}, {
        "id": "832000",
        "name": "石河子市"
    }, {"id": "834300", "name": "塔城地区"}, {"id": "845000", "name": "图木舒克市"}, {
        "id": "838000",
        "name": "吐鲁番地区"
    }, {"id": "830000", "name": "乌鲁木齐市"}, {"id": "831300", "name": "五家渠市"}, {"id": "835499", "name": "伊犁哈萨克"}]
}, {
    "id": "540000",
    "name": "西藏",
    "child": [{"id": "859000", "name": "阿里地区"}, {"id": "854000", "name": "昌都地区"}, {
        "id": "850000",
        "name": "拉萨市"
    }, {"id": "860000", "name": "林芝地区"}, {"id": "852000", "name": "那曲地区"}, {
        "id": "857000",
        "name": "日喀则市"
    }, {"id": "856000", "name": "山南地区"}]
}, {
    "id": "530000",
    "name": "云南省",
    "child": [{"id": "678000", "name": "保山市"}, {"id": "675000", "name": "楚雄彝族"}, {
        "id": "671000",
        "name": "大理白族"
    }, {"id": "678400", "name": "德宏傣族景颇族"}, {"id": "674400", "name": "迪庆藏族"}, {
        "id": "661100",
        "name": "红河哈尼族彝族"
    }, {"id": "650000", "name": "昆明市"}, {"id": "674100", "name": "丽江市"}, {
        "id": "677000",
        "name": "临沧市"
    }, {"id": "673200", "name": "怒江傈僳族"}, {"id": "665000", "name": "普洱市"}, {
        "id": "655000",
        "name": "曲靖市"
    }, {"id": "663000", "name": "文山壮族苗族"}, {"id": "666100", "name": "西双版纳傣族"}, {
        "id": "653100",
        "name": "玉溪市"
    }, {"id": "657000", "name": "昭通市"}]
}, {
    "id": "330000",
    "name": "浙江省",
    "child": [{"id": "310000", "name": "杭州市"}, {"id": "313000", "name": "湖州市"}, {
        "id": "314000",
        "name": "嘉兴市"
    }, {"id": "321000", "name": "金华市"}, {"id": "323000", "name": "丽水市"}, {
        "id": "315000",
        "name": "宁波市"
    }, {"id": "324000", "name": "衢州市"}, {"id": "312000", "name": "绍兴市"}, {
        "id": "318000",
        "name": "台州市"
    }, {"id": "325000", "name": "温州市"}, {"id": "316000", "name": "舟山市"}]
}];
